
var onameindex = [
  '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨',
  '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜',
  '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎',
  '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐',
  '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
  '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄',
  '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧',
  '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝', '董', '梁',
  '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭',
  '梅', '盛', '林', '刁', '钟', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍',
  '虞', '万', '支', '柯', '咎', '管', '卢', '莫', '经', '房', '裘', '缪', '干', '解', '应', '宗',
  '宣', '丁', '贲', '邓',
]

var onames = {
  '赵': {
    'name': '赵',
    'index': '11',
    'remark': '来一段话',
    'ptext': [
      'f1', 
      'f2'
    ],
  },
  '钱': {
    'name': '钱',
    'index': '12',
    'remark': '来一段话',
    'ptext': [
      'fff1'
    ],
  },
  '王': {
    'name': '王',
    'index': '18',
    'remark': '第二段话',
    'ptext': [
      '出自姬姓，为卫国国君康叔的后代。拒《元和姓篡》所载，周文王弟8子康叔为卫国国君，其九世孙叫惠孙，惠孙有个孙子乙，字伍仲，伍仲以祖父的字命氏，就是孙氏。因此他又叫孙仲。孙仲的子孙世居汲郡，是为河南孙氏。',
      '出自芈姓，为春秋时楚国令尹孙叔敖之后。孙叔敖时楚国 期思人，字孙叔，在他任楚令尹时，因教化民众，曾在期思开发水利有功，而深得楚人的拥护，其子孙便以他的字命氏，也称孙氏。',
      '出自妫姓，春秋时陈（为周武王灭商后所封的妫姓国）厉公的儿子叫陈完，因事逃到齐国后，改姓田，田完的5世孙无宇次子田书，为齐国大夫，因有功被齐景公赐姓孙氏。后来齐国内乱，孙书的后人出奔吴国。吴将孙武，其后也。是为山东孙氏。',
    ],
  },
}

module.exports = {
  onameindex,
  onames
}